##### GLOBAL SETTING
cask_args appdir: "~/Applications", require_sha: true

##### TAP SOURCES #####
tap "nikitabobko/tap" # aerospace
tap "FelixKratz/formulae" # janky-borders
tap "sst/tap" # opencode

##### CLI TOOLS #####
brew "colima" # alternative docker daemon
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "ghostscript" # pdf rendering (lazyvim dependency)
cask "git-credential-manager"
brew "imagemagick" # image manipulation (lazyvim dependency)
brew "lazygit"
brew "lazydocker"
brew "lazysql"
brew "luarocks" # lua package manager (lazyvim dependency)
brew "mermaid-cli"
brew "mise"
brew "nvim"
brew "opencode"
brew "pass" # used for gpg-based password management (git-credential-manager)
brew "ripgrep"
brew "stow"
brew "tmux"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

##### FONTS #####
cask "font-roboto-mono-nerd-font"

# Dev Tools
cask "beekeeper-studio"
cask "dbeaver-community"
cask "gitbutler"
cask "ghostty"

# Communications
cask "discord"
cask "signal"
cask "slack"
cask "fastmail"

# Productivity
cask "libreoffice"

# Window Management
cask "aerospace"
brew "borders"

# Project Management
cask "linear-linear"

# Design
cask "figma"

# Notes
cask "obsidian"

# Security
cask "1password"
cask "1password-cli"
mas "1Password for Safari", id: 1569813296

# Web/Search
cask "brave-browser"

# Media
cask "localsend"
cask "spotify", args: {require_sha: false}
