##### GLOBAL SETTING
cask_args appdir: "~/Applications", require_sha: true

##### TAP SOURCES #####
tap "nikitabobko/tap" # aerospace
tap "FelixKratz/formulae" # janky-borders

##### CLI TOOLS #####
brew "fd"
brew "fzf"
cask "git-credential-manager"
brew "goenv"
brew "lazygit"
brew "mas"
brew "nvm"
brew "nvim"
brew "pass" # used for gpg-based password management (git-credential-manager)
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "rust"
brew "stow"
brew "tmux"
brew "tpm" # tmux plugin manager
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

##### FONTS #####
cask "font-roboto-mono-nerd-font"

# Dev Tools
cask "beekeeper-studio"
cask "dbeaver-community"
brew "colima"
brew "docker"
cask "gitbutler"
cask "ghostty"
brew "lazysql"
brew "lazydocker"
cask "orbstack"
cask "visual-studio-code"
cask "qflipper"
mas "Xcode", id: 497799835

# Communications
cask "discord"
cask "slack"
cask "whatsapp"

# Productivity
cask "libreoffice"

# Window Management
cask "aerospace"
brew "borders"

# Project Management
cask "linear-linear"

# Design
cask "figma"

# Notes
cask "obsidian"

# Finance
mas "Copilot: Track & Budget Money", id: 1447330651

# Security
cask "1password"
cask "1password-cli"
mas "1Password for Safari", id: 1569813296

# Web/Search
cask "brave-browser"
cask "nordvpn"
cask "wifiman"

# Media
cask "jellyfin-media-player"
brew "spotify_player"
cask "spotify", args: {require_sha: false}
cask "webtorrent"
