cask_args appdir: "~/Applications", require_sha: true

##### TAP SOURCES #####
tap "nikitabobko/tap" # aerospace
tap "FelixKratz/formulae" # janky-borders
tap "sst/tap" # opencode
brew "mas" # Mac App Store

##### FONTS #####
cask "font-roboto-mono-nerd-font"

##### CLI TOOLS #####
cask "1password-cli"
brew "eza"
brew "fd"
brew "fzf"
brew "ghostscript" # pdf rendering (lazyvim dependency)
cask "git-credential-manager"
brew "glab" # gitlab cli
brew "imagemagick" # image manipulation and rendering (lazyvim dependency)
brew "lazygit"
brew "lazydocker"
brew "lazysql"
brew "luarocks" # lua package manager (lazyvim mason dependency)
brew "mermaid-cli" # mermaid diagram renderer (lazyvim dependency)
brew "mise"
brew "nvim"
brew "opencode"
brew "pass" # used for gpg-based password management (git-credential-manager)
brew "podman"
brew "podman-compose"
brew "ripgrep"
brew "stow"
brew "tiger-vnc"  # vnc client for linux remote desktop
brew "tmux"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

##### GUI APPS #####
cask "1password"
cask "beekeeper-studio"
cask "brave-browser"
cask "bruno" # open-source postman alternative
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
cask "fastmail"
cask "figma"
cask "gitbutler"
cask "ghostty"
cask "libreoffice"
cask "linear-linear"
cask "localsend"
cask "obsidian"
cask "pinta"
cask "podman-desktop"
cask "slack"
cask "signal"
mas "Wireguard", id: 1451685025

##### MISC #####
cask "aerospace"
brew "borders"
